{
  "HR Generalist": {
    "location": "Noida",
    "description": "Role: HR Generalist\nLocation: Noida - Sector 62 (Initially - Patel Nagar for 2-3 months) - Onsite\nDuration: Full Time\n\nRole Description\nWe are seeking an experienced and proactive Human Resources Generalist to join our team. This full-time, on-site position is based in Noida, with additional remote responsibilities supporting our Gwalior office.\nAs an HR Generalist, you will play a pivotal role in shaping and implementing key HR initiatives. Your core responsibilities will include HR policy drafting, compliance, employee relations, recruitment, onboarding, and HR operations. You will oversee benefits administration and ensure the smooth functioning of day-to-day HR processes in line with statutory regulations and organizational values.\nThis role demands a strategic yet empathetic approach, as you will work closely with employees to understand and resolve their HR concerns, enhance workplace satisfaction, and foster a positive and compliant work environment.\n\nQualifications\nBachelor's or Master's degree in HR or related discipline\n2–3 years of relevant HR Generalist experience\nProven expertise in HR policy drafting, legal compliance, and employee relations\nFamiliarity with HRMS tools and applicant tracking systems\nStrong knowledge of Indian labor laws and statutory regulations\nHigh integrity, confidentiality, and ethical professionalism\nStrong organizational and problem-solving capabilities\nAbility to work independently and cross-functionally in a fast-paced environment\nAbility to work on-site and interact directly with employees\nExcellent written and verbal communication skills\nA degree in Human Resources, Business Administration, or related field\nExperience in IT or technology industry is a plus\n\nWhat We Offer:\nCompetitive salary with performance-linked bonuses\nStructured career growth & professional development opportunities\nAccess to learning programs, HR certifications, and workshops\nComprehensive health and wellness benefits\nA collaborative, inclusive, and growth-focused work culture\nPaid time off and work-life balance support."
  },
  "Python Developer – AI Agent Development (CrewAI + LangChain)": {
    "location": "Noida / Gwalior",
    "description": "Role: Python Developer – AI Agent Development (CrewAI + LangChain)\nLocation: Noida / Gwalior (On-site)\nExperience Required: Minimum 3+ years\nEmployment Type: Full-time\n\n🚀 About the Role\nWe're seeking a Python Developer with hands-on experience in CrewAI and LangChain to join our cutting-edge AI product engineering team. If you thrive at the intersection of LLMs, agentic workflows, and autonomous tooling — this is your opportunity to build real-world AI agents that solve complex problems at scale.\nYou'll be responsible for designing, building, and deploying intelligent agents that leverage prompt engineering, memory systems, vector databases, and multi-step tool execution strategies.\n\n🧠 Core Responsibilities\nDesign and develop modular, asynchronous Python applications using clean code principles.\nBuild and orchestrate intelligent agents using CrewAI: defining agents, tasks, memory, and crew dynamics.\nDevelop custom chains and tools using LangChain (LLMChain, AgentExecutor, memory, structured tools).\nImplement prompt engineering techniques like ReAct, Few-Shot, and Chain-of-Thought reasoning.\nIntegrate with APIs from OpenAI, Anthropic, HuggingFace, or Mistral for advanced LLM capabilities.\nUse semantic search and vector stores (FAISS, Chroma, Pinecone, etc.) to build RAG pipelines.\nExtend tool capabilities: web scraping, PDF/document parsing, API integrations, and file handling.\nImplement memory systems for persistent, contextual agent behavior.\nLeverage DSA and algorithmic skills to structure efficient reasoning and execution logic.\nDeploy containerized applications using Docker, Git, and modern Python packaging tools.\n\n🛠️ Must-Have Skills\nPython 3.x (Async, OOP, Type Hinting, Modular Design)\nCrewAI (Agent, Task, Crew, Memory, Orchestration) – Must Have\nLangChain (LLMChain, Tools, AgentExecutor, Memory)\nPrompt Engineering (Few-Shot, ReAct, Dynamic Templates)\nLLMs & APIs (OpenAI, HuggingFace, Anthropic)\nVector Stores (FAISS, Chroma, Pinecone, Weaviate)\nRetrieval-Augmented Generation (RAG) Pipelines\nMemory Systems: BufferMemory, ConversationBuffer, VectorStoreMemory\nAsynchronous Programming (asyncio, LangChain hooks)\nDSA / Algorithms (Graphs, Queues, Recursion, Time/Space Optimization)\n\n💡 Bonus Skills\nExperience with Machine Learning libraries (Scikit-learn, XGBoost, TensorFlow basics)\nFamiliarity with NLP concepts (Embeddings, Tokenization, Similarity scoring)\nDevOps familiarity (Docker, GitHub Actions, Pipenv/Poetry)\n\n🧭 Why Join Us?\nWork on cutting-edge LLM agent architecture with real-world impact.\nBe part of a fast-paced, experiment-driven AI team.\nCollaborate with passionate developers and AI researchers.\nOpportunity to build from scratch and influence core product design."
  }
}