{
  "HR Generalist": {
    "location": "Noida",
    "description": "Role: HR Generalist\nLocation: Noida - Sector 62 (Initially - Patel Nagar for 2-3 months) - Onsite\nDuration: Full Time\n\nRole Description\nWe are seeking an experienced and proactive Human Resources Generalist to join our team. This full-time, on-site position is based in Noida, with additional remote responsibilities supporting our Gwalior office.\nAs an HR Generalist, you will play a pivotal role in shaping and implementing key HR initiatives. Your core responsibilities will include HR policy drafting, compliance, employee relations, recruitment, onboarding, and HR operations. You will oversee benefits administration and ensure the smooth functioning of day-to-day HR processes in line with statutory regulations and organizational values.\nThis role demands a strategic yet empathetic approach, as you will work closely with employees to understand and resolve their HR concerns, enhance workplace satisfaction, and foster a positive and compliant work environment.\n\nQualifications\nBachelor's or Master's degree in HR or related discipline\n2–3 years of relevant HR Generalist experience\nProven expertise in HR policy drafting, legal compliance, and employee relations\nFamiliarity with HRMS tools and applicant tracking systems\nStrong knowledge of Indian labor laws and statutory regulations\nHigh integrity, confidentiality, and ethical professionalism\nStrong organizational and problem-solving capabilities\nAbility to work independently and cross-functionally in a fast-paced environment\nAbility to work on-site and interact directly with employees\nExcellent written and verbal communication skills\nA degree in Human Resources, Business Administration, or related field\nExperience in IT or technology industry is a plus\n\nWhat We Offer:\nCompetitive salary with performance-linked bonuses\nStructured career growth & professional development opportunities\nAccess to learning programs, HR certifications, and workshops\nComprehensive health and wellness benefits\nA collaborative, inclusive, and growth-focused work culture\nPaid time off and work-life balance support\n\n---\n**Sameer K**\nRecruitment Manager\n\nLinkedin: linkedin.com/in/technical-manager\nWebsite: www.techcarrel.com"
  },
  "Python Developer – AI Agent Development (CrewAI + LangChain)": {
    "location": "Noida",
    "description": "Role: Python Developer – AI Agent Development (CrewAI + LangChain)\nLocation: Noida / Gwalior (On-site)\nExperience Required: Minimum 3+ years\nEmployment Type: Full-time\n\n🚀 About the Role\nWe're seeking a Python Developer with hands-on experience in CrewAI and LangChain to join our cutting-edge AI product engineering team. If you thrive at the intersection of LLMs, agentic workflows, and autonomous tooling — this is your opportunity to build real-world AI agents that solve complex problems at scale.\nYou'll be responsible for designing, building, and deploying intelligent agents that leverage prompt engineering, memory systems, vector databases, and multi-step tool execution strategies.\n\n🧠 Core Responsibilities\nDesign and develop modular, asynchronous Python applications using clean code principles.\nBuild and orchestrate intelligent agents using CrewAI: defining agents, tasks, memory, and crew dynamics.\nDevelop custom chains and tools using LangChain (LLMChain, AgentExecutor, memory, structured tools).\nImplement prompt engineering techniques like ReAct, Few-Shot, and Chain-of-Thought reasoning.\nIntegrate with APIs from OpenAI, Anthropic, HuggingFace, or Mistral for advanced LLM capabilities.\nUse semantic search and vector stores (FAISS, Chroma, Pinecone, etc.) to build RAG pipelines.\nExtend tool capabilities: web scraping, PDF/document parsing, API integrations, and file handling.\nImplement memory systems for persistent, contextual agent behavior.\nLeverage DSA and algorithmic skills to structure efficient reasoning and execution logic.\nDeploy containerized applications using Docker, Git, and modern Python packaging tools.\n\n🛠️ Must-Have Skills\nPython 3.x (Async, OOP, Type Hinting, Modular Design)\nCrewAI (Agent, Task, Crew, Memory, Orchestration) – Must Have\nLangChain (LLMChain, Tools, AgentExecutor, Memory)\nPrompt Engineering (Few-Shot, ReAct, Dynamic Templates)\nLLMs & APIs (OpenAI, HuggingFace, Anthropic)\nVector Stores (FAISS, Chroma, Pinecone, Weaviate)\nRetrieval-Augmented Generation (RAG) Pipelines\nMemory Systems: BufferMemory, ConversationBuffer, VectorStoreMemory\nAsynchronous Programming (asyncio, LangChain hooks)\nDSA / Algorithms (Graphs, Queues, Recursion, Time/Space Optimization)\n\n💡 Bonus Skills\nExperience with Machine Learning libraries (Scikit-learn, XGBoost, TensorFlow basics)\nFamiliarity with NLP concepts (Embeddings, Tokenization, Similarity scoring)\nDevOps familiarity (Docker, GitHub Actions, Pipenv/Poetry)\n\n🧭 Why Join Us?\nWork on cutting-edge LLM agent architecture with real-world impact.\nBe part of a fast-paced, experiment-driven AI team.\nCollaborate with passionate developers and AI researchers.\nOpportunity to build from scratch and influence core product design.\n\n---\n**Sameer K**\nRecruitment Manager\n\nLinkedin: linkedin.com/in/technical-manager\nWebsite: www.techcarrel.com"
  },
  "Mern Stack Developer": {
    "location": "Noida",
    "description": "Title: Mern Stack Developer\nDuration: Full Time\nLocation: Noida - Onsite\nMust Have: React, Express, Restful, ORM\n\nCore Responsibilities\n- Develop scalable Node.js/Express microservices with secure APIs (REST/GraphQL)\n- Optimize MongoDB schemas (indexing, transactions) and PostgreSQL integrations\n- Build React/Redux (TypeScript) interfaces with real-time features (WebSockets/SSE)\n- Implement security protocols: JWT/OAuth, rate-limiting, RBAC, and data encryption\n- Enhance performance via Redis caching, code splitting, and bundle optimization\n- Write test suites (Jest/Mocha) and debug production systems\n\nRequired Skills\nBackend: Node.js | Express.js | Microservices\nDatabase: MongoDB (aggregation/replication) | PostgreSQL\nAPIs: REST | GraphQL (Apollo) | WebSockets\nFrontend: React.js | Redux (RTK/Sagas) | TypeScript\nDevOps: AWS Lambda | Docker | CI/CD\n\nBonus Skills\n- Next.js SSR/SSG | Monorepos (Turborepo/Nx)\n- Serverless Architecture | Performance tuning\n\nWhy Join Us?\n- Impactful projects with a cutting-edge tech stack\n- Culture of innovation and engineering excellence\n- Career growth with competitive compensation\n\n---\n**Sameer K**\nRecruitment Manager\n\nLinkedin: linkedin.com/in/technical-manager\nWebsite: www.techcarrel.com"
  },
  "Flutter Developer": {
    "location": "Noida",
    "description": "Job Title: Flutter Developer\nEmployment Type: Full-time\nExperience Level: 2–3 years (Mid-Level)\n\nAbout the Role:\nWe are looking for a passionate and skilled Flutter Developer to join our mobile app development team. You will be responsible for translating design wireframes into functional, high-performance cross-platform applications. This role demands a keen eye for detail, performance optimization, and collaboration with product, UI/UX, and backend teams.\n\nKey Responsibilities\n• Develop high-quality, maintainable, and scalable cross-platform apps using Flutter (Android and iOS).\n• Translate UI/UX design wireframes, Figma files, or prototypes into fully functional app screens.\n• Integrate RESTful APIs, WebSockets, and third-party SDKs efficiently.\n• Write clean and modular Dart code following best practices.\n• Manage state using providers, BLoC, Riverpod, or GetX (as per project requirement).\n• Participate in app architecture design, component planning, and project discussions.\n• Optimize app performance and responsiveness across devices and OS versions.\n• Conduct thorough unit and integration testing.\n• Collaborate with QA for debugging and issue resolution.\n• Use version control tools (e.g., Git) effectively for codebase management.\n• Stay up to date with Flutter updates and mobile development trends.\n\nMust-Have Skills:\n• Proficiency in Dart and Flutter SDK.\n• Experience working with RESTful APIs, JSON, and handling asynchronous data.\n• Familiarity with state management solutions such as Provider, BLoC, Riverpod, etc.\n• Solid understanding of Material Design principles and platform-specific UI guidelines.\n• Experience with Firebase services (Auth, Cloud Firestore, Push Notifications).\n• Strong understanding of responsive design and mobile performance optimization.\n• Ability to work with version control systems like Git and manage branching and pull requests.\n\nNice-to-Have Skills:\n• Familiarity with native iOS/Android development (Swift/Kotlin).\n• Experience in publishing and managing apps on the Play Store and App Store.\n• Knowledge of CI/CD pipelines for mobile apps.\n• Basic understanding of GraphQL, Socket.IO, or MQTT.\n• Familiarity with writing unit, widget, and integration tests.\n• Experience in Flutter Web or Flutter Desktop.\n\nCollaboration Expectations:\n• Work closely with UI/UX designers to implement accurate and user-friendly designs.\n• Collaborate with backend developers to ensure smooth API integrations.\n• Communicate clearly with the product and QA teams during sprints and releases.\n• Participate in daily standups, sprint planning, and code reviews.\n\nTools and Platforms:\n• Design: Figma, Adobe XD, Zeplin\n• Project Management: Jira, ClickUp, Trello\n• Version Control: Git, GitHub, GitLab\n• Communication: Slack, Microsoft Teams\n\nWhat Success Looks Like:\n• Deliver pixel-perfect, bug-free app features on time.\n• Improve app performance by reducing load times and app size.\n• Ensure high test coverage for all core functionalities.\n• Stay proactive in identifying and suggesting improvements to UX and technical workflows.\n\n---\n**Sameer K**\nRecruitment Manager\n\nLinkedin: linkedin.com/in/technical-manager\nWebsite: www.techcarrel.com"
  },
  "Technical Project Manager (ClickUp & Process Automation)": {
    "location": "Noida",
    "description": "Title: Technical Project Manager (ClickUp & Process Automation)\nLocation: Noida, Sec 62 (Initial 2-3 months in Patel Nagar, New Delhi)\nSchedule: Full-Time; We work on 2nd & 4th Saturday as well.\n\nSummary:\nWe are seeking a hyper-organized and process-driven Agile Delivery Specialist to be the backbone of our project execution. In this role, you will be the expert on our primary project management tool, ClickUp, using it to build automated, transparent, and efficient workflows. You will be responsible for breaking down complex projects into actionable sprints, ensuring our development teams have crystal-clear user stories, and providing data-driven insights to leadership. The ideal candidate is a master of Agile methodologies, a wizard with workflow automation, and possesses the technical aptitude to bridge the gap between our product and engineering teams.\n\nKey Responsibilities:\nAgile & Sprint Management: Plan, execute, and oversee sprints from start to finish. Define clear sprint goals, facilitate Agile ceremonies (stand-ups, retrospectives, planning), and ensure the team is consistently delivering value.\nClickUp & Workflow Automation: Own our ClickUp environment. Design and maintain dashboards for tracking team velocity, project health, and executive reporting. Build and implement automations to streamline task creation, notifications, and backlog management.\nTechnical Translation & Documentation: Decompose large-scale projects into well-defined epics and user stories (INVEST framework). Create and maintain clear, accessible documentation, including Standard Operating Procedures (SOPs), process maps (Miro/Lucidchart), and technical workflows.\nResource & Risk Management: Proactively manage multi-project timelines and dependencies. Forecast resource needs, identify potential bottlenecks or risks, and develop mitigation plans to keep projects on track.\nStakeholder Communication: Serve as a key point of contact for project updates. Communicate progress, insights, and outcomes effectively to both technical teams and non-technical stakeholders through reports, demos, and presentations.\n\nRequired Skills & Experience:\nExpert-level proficiency in ClickUp, including building complex dashboards, custom fields, and multi-step automations.\nProven experience in an Agile/Scrum environment, with a strong understanding of concepts like WBS, user story creation, and sprint planning.\nDemonstrated ability to create clear visual documentation (flowcharts, wireframes, journey maps) using tools like Miro, Lucidchart, or Figma.\nSolid technical understanding of software development concepts (e.g., APIs, basic database design, Git workflows) is essential.\nExperience managing multiple projects simultaneously and a proven ability to prioritize effectively.\nExcellent communication skills, with the ability to coach teams on Agile best practices.\n\n---\n**Sameer K**\nRecruitment Manager\n\nLinkedin: linkedin.com/in/technical-manager\nWebsite: www.techcarrel.com"
  }
}
